In [1]:
import numpy as np
import pandas as pd

### Importing Datasets

In [2]:
df1 = pd.read_csv('df5000-6001.csv')

In [3]:
df2 = pd.read_csv('df6000-7001.csv')

In [4]:
df3 = pd.read_csv('df7000-8001.csv')

In [5]:
df4 = pd.read_csv('df8000-9001.csv')

In [6]:
df5 = pd.read_csv('df9000-10001.csv')

### Appending Datasets

In [7]:
sales_df = df1.append([df2, df3, df4, df5])

In [8]:
sales_df

      Unnamed: 0    id amount_ethereum amount_dollars transaction_date
0              0  5000           0.30Ξ          ($67)     Aug 03, 2017
1              1  5001           1.20Ξ         ($247)     Jul 29, 2017
2              2  5002            205Ξ     ($382,579)     Jul 17, 2021
3              3  5002             49Ξ      ($11,542)     Jun 01, 2020
4              4  5002           0.26Ξ          ($88)     Oct 13, 2017
...          ...   ...             ...            ...              ...
1534        1534  9990          24.50Ξ      ($44,981)     Mar 20, 2021
1535        1535  9997          99.99Ξ     ($169,770)     Feb 08, 2021
1536        1536  9997             59Ξ      ($21,062)     Sep 27, 2020
1537        1537  9998             38Ξ      ($61,170)     Mar 03, 2021
1538        1538  9998             15Ξ       ($9,499)     Dec 27, 2020

[7879 rows x 5 columns]

# Data cleaning

### Value's anomalies detection

"amount_ethereum" column is expressing its results with an "Ξ" attached next to the value

In [9]:
sales_df.amount_ethereum.value_counts()

0.25Ξ     217
0.10Ξ     158
0.30Ξ     117
0.50Ξ     116
1Ξ        106
         ...
16.86Ξ      1
1.74Ξ       1
40.50Ξ      1
36.60Ξ      1
2.35Ξ       1
Name: amount_ethereum, Length: 1199, dtype: int64

"amount_dollars" column is expressing its results wraped by parenthesis and with the $ character

In [10]:
sales_df.amount_dollars.value_counts()

($45)         89
($38)         49
($47)         45
($118)        35
($60)         34
              ..
($724)         1
($5,398)       1
($830)         1
($45,899)      1
($191,680)     1
Name: amount_dollars, Length: 4996, dtype: int64

There are some values between 0 and 0.01. In order to convert these columns to numeric, it's necessary to modify its values to FLOAT. We will covert them all to "0.01"

In [11]:
sales_df.sort_values(by='amount_dollars', ascending=False)

      Unnamed: 0    id amount_ethereum amount_dollars transaction_date
1242        1242  9776          <0.01Ξ       ($<0.01)     Aug 06, 2018
1240        1240  8789          <0.01Ξ       ($<0.01)     Sep 20, 2020
1025        1025  5674          19.20Ξ       ($<0.01)     May 06, 2021
1355        1355  8871          <0.01Ξ       ($<0.01)     Sep 17, 2020
610          610  7387          <0.01Ξ       ($<0.01)     Sep 17, 2020
...          ...   ...             ...            ...              ...
109          109  9085           0.00Ξ        ($0.00)     Jul 18, 2021
961          961  9620           0.00Ξ        ($0.00)     Jul 16, 2021
675          675  9426           0.00Ξ        ($0.00)     Jul 10, 2021
1462        1462  9926          <0.01Ξ           ($0)     Jun 24, 2017
1270        1270  8815          <0.01Ξ           ($0)     Jul 10, 2017

[7879 rows x 5 columns]

There are some transactions which are being displayed under the "million" (M) nomenclature. They got to be converted before doing any kind of exploration.

In [12]:
sales_df.loc[sales_df['id']==6487]

     Unnamed: 0    id amount_ethereum amount_dollars transaction_date
737         737  6487            550Ξ       ($1.05M)     Feb 22, 2021
738         738  6487            100Ξ      ($20,857)     May 24, 2020

### Dropping unnecessary column and removing unwanted characters ( "Ξ" & parenthesis)

In [13]:
sales_df.drop(columns=['Unnamed: 0'], inplace=True)

In [14]:
values_to_replace_dollars = ['$', '(', ')', ',', '<']
values_to_replace_ethereum = ['Ξ', ',', '<']

for x in values_to_replace_dollars:
    sales_df['amount_dollars'] = sales_df['amount_dollars'].str.replace(x,'')
    
for x in values_to_replace_ethereum:
    sales_df['amount_ethereum'] = sales_df['amount_ethereum'].str.replace(x,'')

In [15]:
sales_df

        id amount_ethereum amount_dollars transaction_date
0     5000            0.30             67     Aug 03, 2017
1     5001            1.20            247     Jul 29, 2017
2     5002             205         382579     Jul 17, 2021
3     5002              49          11542     Jun 01, 2020
4     5002            0.26             88     Oct 13, 2017
...    ...             ...            ...              ...
1534  9990           24.50          44981     Mar 20, 2021
1535  9997           99.99         169770     Feb 08, 2021
1536  9997              59          21062     Sep 27, 2020
1537  9998              38          61170     Mar 03, 2021
1538  9998              15           9499     Dec 27, 2020

[7879 rows x 4 columns]

### Converting Million nomenclature values to standard format

In [16]:
multipliers = {'K':1000, 'M':1000000, 'B':1000000000}

def string_to_int(string):
    if string[-1].isdigit(): # check if no suffix
        return float(string)
    mult = multipliers[string[-1]] # look up suffix to get multiplier
     # convert number to float, multiply by multiplier, then make int
    return int(float(string[:-1]) * mult)

testvals = ["150M", "360M", "2.6B", "3.7B"]

print(list(map(string_to_int, testvals)))

[150000000, 360000000, 2600000000, 3700000000]

In [17]:
sales_df['amount_dollars'] = sales_df['amount_dollars'].map(string_to_int)

In [21]:
sales_df['amount_ethereum'] = sales_df['amount_ethereum'].map(string_to_int)

checking same punk_id with previous "M" nomenclature

In [18]:
sales_df.loc[sales_df['id']==6487]

       id amount_ethereum  amount_dollars transaction_date
737  6487             550       1050000.0     Feb 22, 2021
738  6487             100         20857.0     May 24, 2020

### Define Types to work with

In [25]:
sales_df.amount_ethereum = sales_df.amount_ethereum.astype('float')
sales_df.amount_dollars = sales_df.amount_dollars.astype('float')
sales_df.transaction_date = sales_df.transaction_date.astype('datetime64')

In [26]:
sales_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7879 entries, 0 to 1538
Data columns (total 4 columns):
id                  7879 non-null int32
amount_ethereum     7879 non-null float64
amount_dollars      7879 non-null float64
transaction_date    7879 non-null datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int32(1)
memory usage: 277.0 KB

In [27]:
sales_df.describe()

                id  amount_ethereum  amount_dollars
count  7879.000000      7879.000000    7.879000e+03
mean   7489.610484        13.753407    2.646613e+04
std    1430.529939        51.941691    9.675711e+04
min    5000.000000         0.000000    0.000000e+00
25%    6254.000000         1.000000    2.220000e+02
50%    7473.000000         5.600000    2.816000e+03
75%    8728.000000        21.000000    4.123700e+04
max    9998.000000      4200.000000    7.570000e+06

### Export .csv

In [28]:
sales_df.to_csv('sales.csv')